#ifndef TIMETABLE_H
#define TIMETABLE_H

#include <string>

const int WORKING_DAYS_NUMBER = 6;

const std::string WORKING_DAYS[WORKING_DAYS_NUMBER]
{ 
	(const std::string)"Понедельник",
	(const std::string)"Вторник",
	(const std::string)"Среда",
	(const std::string)"Четверг",
	(const std::string)"Пятница",
	(const std::string)"Суббота"
};

const std::string TIMETABLES_FOR_DAYS[WORKING_DAYS_NUMBER] =
{
	(
		(const std::string)" |                 |                   I лк 200-3а Математический анализ доц. Чайковский М.В.                    |\n" +
		(const std::string)" |  14:40 - 16:00  +---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |                 |                              II пз 111-4 Математический анализ                              |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |  16:30 - 17:50  |                пз 221-2 общ.                 |                пз 111-2 общ.                 |\n" +
		(const std::string)" |                 |               Английский язык                |               Английский язык                |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |  18:05 - 19:25  |               лр 303-1 Основы                |            лр 324-1 Компьютерные             |\n" +
		(const std::string)" |                 |            программной инженерии             |                языки разметки                |\n" +
		(const std::string)" +=================+==============================================+==============================================+\n"
	),

	(
		(const std::string)" |  14:40 - 16:00  |            лр 310а-1 Компьютерные            |               лр 324-1 Основы                |\n" +
		(const std::string)" |                 |                языки разметки                |            программной инженерии             |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |  16:30 - 17:50  |                     лк 200-3а Основы алгоритмизации и программирования                      |\n" +
		(const std::string)" |                 |                                      доц. Белодед Н.И                                       |\n" +
		(const std::string)" +-----------------+---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |  18:05 - 19:25  |                                  пз 423-4 Белорусский язык                                  |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +=================+=============================================================================================+\n"
	),

	(
		(const std::string)" |  14:40 - 16:00  |                лк 200-3а Арифметико-логические основы вычислительных систем                 |\n" +
		(const std::string)" |                 |                                      доц. Гринюк Д.А.                                       |\n" +
		(const std::string)" +-----------------+---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |  16:30 - 17:50  |                                     Физическая культура                                     |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +-----------------+---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |  18:05 - 19:25  |                    лк 100-3а Линейная алгебра и аналитическая геометрия                     |\n" +
		(const std::string)" |                 |                                    доц. Чайковский М.В.                                     |\n" +
		(const std::string)" +=================+=============================================================================================+\n"
	),

	(
		(const std::string)" |  14:40 - 16:00  |        I пз 221-2 общ. Английский язык       |   II пз 126-4 Арифметико-логические основы   |\n" +
		(const std::string)" |                 |                                              |             вычислительных систем            |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |  16:30 - 17:50  |                           лк 200-3а Основы программной инженерии                            |\n" +
		(const std::string)" |                 |                                   ст. преп. Наркевич А.С                                    |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |  18:05 - 19:25  |                                              |         пз 111-2 общ. Английский язык        |\n" +
		(const std::string)" |                 |                                              |                                              |\n" +
		(const std::string)" +=================+==============================================+==============================================+\n"
	),

	(
		(const std::string)" |  14:40 - 16:00  |        лр 413-1 Основы алгоритмизации        |        лр 322-1 Основы алгоритмизации        |\n" +
		(const std::string)" |                 |              и программирования              |              и программирования              |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |  16:30 - 17:50  |                                  пз 360-4 Линейная алгебра                                  |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +-----------------+---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |  18:05 - 19:25  |                               пз 360-4 Математический анализ                                |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |                 |         I лк 100-3а Великая Отечественная война советского народа доц. Андарало И.А         |\n" +
		(const std::string)" |  19:40 - 21:00  +----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |                 |       II пз 221-2 общ. Английский язык       |                                              |\n" +
		(const std::string)" +=================+==============================================+==============================================+\n"
	),

	(
		(const std::string)" |  11:25 - 12:45  |                     лк 100-3а Математический анализ доц. Чайковский М.В                     |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +-----------------+---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |  13:00 - 14:20  |                                     Физическая культура                                     |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +-----------------+---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |  14:40 - 16:00  |                  лк 200-3а Компьютерные языки разметки асс. Барковский Е.В                  |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +=================+==============================================+==============================================+\n"
	)
};

void timetable();
void showTimetable(unsigned day);	// Вывод расписания по дню недели

#endif
