#ifndef TIMETABLE_H
#define TIMETABLE_H

#include <string>

const int WORKING_DAYS_NUMBER = 6;

const std::string WORKING_DAYS[WORKING_DAYS_NUMBER]
{ 
	(const std::string)"Панядзелак",
	(const std::string)"Аўторак",
	(const std::string)"Серада",
	(const std::string)"Чацвер",
	(const std::string)"Пятніца",
	(const std::string)"Субота"
};

const std::string TIMETABLES_FOR_DAYS[WORKING_DAYS_NUMBER] =
{
	(
		(const std::string)" |                 |                     I лк 200-3а Матэматычны аналіз дац. Чайкоўскі М. В.                     |\n" +
		(const std::string)" |  14:40 - 16:00  +---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |                 |                               II пз 111-4 Матэматычны аналіз                                |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |  16:30 - 17:50  |                пз 221-2 інт.                 |                пз 111-2 інт.                 |\n" +
		(const std::string)" |                 |               Ангельская мова                |               Ангельская мова                |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |  18:05 - 19:25  |               лр 303-1 Асновы                |            лр 324-1 Камп'ютарныя             |\n" +
		(const std::string)" |                 |             праграмнай інжынерыі             |                мовы разметкі                 |\n" +
		(const std::string)" +=================+==============================================+==============================================+\n"
	),

	(
		(const std::string)" |  14:40 - 16:00  |            лр 310а-1 Камп'ютарныя            |               лр 324-1 Асновы                |\n" +
		(const std::string)" |                 |                мовы разметкі                 |             праграмнай інжынерыі             |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |  16:30 - 17:50  |                       лк 200-3а Асновы алгарытмізацыі і праграмавання                       |\n" +
		(const std::string)" |                 |                                     дац. Беладзед М. І.                                     |\n" +
		(const std::string)" +-----------------+---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |  18:05 - 19:25  |                                  пз 423-4 Беларуская мова                                   |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +=================+=============================================================================================+\n"
	),

	(
		(const std::string)" |  14:40 - 16:00  |                   лк 200-3а Арыфметыка-лагічныя асновы вылічальных сістэм                   |\n" +
		(const std::string)" |                 |                                     дац. Грынюк Дз. А.                                      |\n" +
		(const std::string)" +-----------------+---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |  16:30 - 17:50  |                                      Фізічная культура                                      |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +-----------------+---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |  18:05 - 19:25  |                     лк 100-3а Лінейная алгебра и аналітычная геаметрыя                      |\n" +
		(const std::string)" |                 |                                    дац. Чайкоўскі М. В.                                     |\n" +
		(const std::string)" +=================+=============================================================================================+\n"
	),

	(
		(const std::string)" |  14:40 - 16:00  |       I пз 221-2 інт. Ангельская мова        |    II пз 126-4 Арыфметыка-лагічныя Асновы    |\n" +
		(const std::string)" |                 |                                              |              вылічальных сістэм              |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |  16:30 - 17:50  |                            лк 200-3а Асновы праграмнай інжынерыі                            |\n" +
		(const std::string)" |                 |                                  ст. выкл. Наркевіч А. С.                                   |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |  18:05 - 19:25  |                                              |        пз 111-2 інт. Ангельская мова         |\n" +
		(const std::string)" |                 |                                              |                                              |\n" +
		(const std::string)" +=================+==============================================+==============================================+\n"
	),

	(
		(const std::string)" |  14:40 - 16:00  |        лр 413-1 Асновы алгарытмізацыі        |        лр 322-1 Асновы алгарытмізацыі        |\n" +
		(const std::string)" |                 |               і праграмавання                |               і праграмавання                |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |  16:30 - 17:50  |                                  пз 360-4 Лінейная алгебра                                  |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +-----------------+---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |  18:05 - 19:25  |                                 пз 360-4 Матэматычны аналіз                                 |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +-----------------+----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |                 |                   I лк 100-3а Другая сусветная вайна дац. Андарала І. А.                    |\n" +
		(const std::string)" |  19:40 - 21:00  +----------------------------------------------+----------------------------------------------+\n" +
		(const std::string)" |                 |       II пз 221-2 інт. Ангельская мова       |                                              |\n" +
		(const std::string)" +=================+==============================================+==============================================+\n"
	),

	(
		(const std::string)" |  11:25 - 12:45  |                      лк 100-3а Матэматычны аналіз дац. Чайкоўскі М. В.                      |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +-----------------+---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |  13:00 - 14:20  |                                      Фізічная культура                                      |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +-----------------+---------------------------------------------------------------------------------------------+\n" +
		(const std::string)" |  14:40 - 16:00  |                  лк 200-3а Камп'ютарныя мовы разметкі ас. Баркоўскі Я. В.                   |\n" +
		(const std::string)" |                 |                                                                                             |\n" +
		(const std::string)" +=================+==============================================+==============================================+\n"
	)
};

void timetable();
void showTimetable(unsigned day);

#endif
